Revit 2027 API
TextBox.Value Property
The object that supplies the text value.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Object Value { get; set; }
Public Property Value As Object
	Get
	Set
public:
property Object^ Value {
	Object^ get ();
	void set (Object^ value);
}
member Value : Object with get, set
Property Value
Object
Remarks
 The value assigned to the TextBox can be a String or any other data type. If the type is not a String the TextBox will display the return of the ToString() method. When the text is edited in the UI, the type of Value will always be String.
See Also
Reference
TextBox Class
Autodesk.Revit.UI Namespace